
# вывод 
# print('hello world')
# print("hello world")
# print(21)



# создание и вывод переменной
# num = 5
# print(num)



# создание и изменение переменной
# num_2 =  9
# print(num_2)
# num_2 = 0
# print(num_2)



# число с плавающей точкой
# print(4.5)

# вывод нескольких значений и переменных
# print(2 , "     " , 5 , "qwerty" , 0.1)

# перенос строки
# print("qwertyu\niopasdf")



# арифметические операторы:
# print("2 + 2 =" , 2 + 2) #Сумма
# print("2 - 2 =" , 2 - 2) #Вычитание
# print("2 * 3 =" , 2 * 3) #Умножение
# print("2 ** 3 =" , 2 ** 3) #Возведение в степень
# print("10 / 3 =" , 10 / 3) #Деление
# print("10 // 3 =" , 10 // 3) #деление без остатка 
# print("10 % 3 =" , 10 % 3) #остаток от деления



# умножаем переменную на 3 и сохраняем
# num_3 = 4
# print(num_3)
# num_3 = num_3 * 3
# print(num_3)



# # пример названия переменных
qwerty = 5
hello_world = 5
helloWorld = 5
qw4ert5 = 8





# дз
# задача 1
# Дана диагональ телевизора в дюймах. Написать программу, определяющую эту же диагональ в сантиметрах 
# (1 дюйм = 2.54 сантиметров).
# Ниже представлен пример для проверки программы 
# на корректностью

# задача 2
# Емкость аккумулятора смартфона составляет N мАч. 
# Написать программу, определяющую минимальную 
# емкость переносного зарядного устройства (powerbank), 
# если необходимо 3 полных заряда смартфона.
# Ниже представлен пример для проверки программы 
# на корректность.

# задача 3
# Напишите программу, которая вычисляем объём шара.

# задача 4
# Написать программу вычисления расстояния 
# между двумя точками.

